
### :robot: Terraform Report
---
##### Plan: `9` to add, `3` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["check-git"] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "selected"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "check-git"

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "ahmadnassri/action-terraform-report@*",
            ]
          + verified_allowed     = true
        }
    }

  # github_actions_repository_permissions.this["k8s-labels-migrator"] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "selected"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "k8s-labels-migrator"

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "ahmadnassri/action-terraform-report@*",
            ]
          + verified_allowed     = true
        }
    }

  # github_actions_repository_permissions.this["proxmox-sdk"] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "selected"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "proxmox-sdk"

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "ahmadnassri/action-terraform-report@*",
            ]
          + verified_allowed     = true
        }
    }

  # github_branch_protection.this["check-git"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "check-git"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + strict = false
        }
    }

  # github_branch_protection.this["k8s-labels-migrator"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "k8s-labels-migrator"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + strict = false
        }
    }

  # github_branch_protection.this["proxmox-sdk"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "proxmox-sdk"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + strict = false
        }
    }

  # github_repository.repositories["check-git"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
      + archive_on_destroy          = true
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "CLI to easily check which local repositories have uncommitted changes" -> "CLI to easily check which local repositories have uncommitted changes."
      ~ has_downloads               = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
        id                          = "check-git"
        name                        = "check-git"
      ~ topics                      = [
          + "cli",
          + "git",
        ]
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["k8s-labels-migrator"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
      + archive_on_destroy          = true
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "Your favorite tool to migrate labels on your deployments without any downtime" -> "Your favorite tool to migrate labels on your deployments without any downtime."
      ~ has_downloads               = true -> false
      ~ has_projects                = true -> false
        id                          = "k8s-labels-migrator"
        name                        = "k8s-labels-migrator"
      - vulnerability_alerts        = true -> null
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["proxmox-sdk"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
      + archive_on_destroy          = true
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "Opiniated and abtracted Typescript SDK for Proxmox" -> "About Opiniated and abtracted Typescript SDK for Proxmox."
      ~ has_downloads               = true -> false
      ~ has_projects                = true -> false
        id                          = "proxmox-sdk"
        name                        = "proxmox-sdk"
      ~ topics                      = [
          + "npm",
          + "proxmox",
          + "sdk",
          + "typescript",
        ]
      - vulnerability_alerts        = true -> null
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.renovate_json["check-git"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "check-git"
      + sha                          = (known after apply)
    }

  # github_repository_file.renovate_json["k8s-labels-migrator"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "k8s-labels-migrator"
      + sha                          = (known after apply)
    }

  # github_repository_file.renovate_json["proxmox-sdk"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "proxmox-sdk"
      + sha                          = (known after apply)
    }

Plan: 9 to add, 3 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11314913148`](https://github.com/Tchoupinax/repo-config/actions/runs/11314913148) - commit 745e7437bc1d7cf8353564c88199dd4f0f5977b8
